tsung_tests/tsung_login_logout.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="1000" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="localhost" port="3000" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>

    <session name="login-logout" weight="1" type="ts_http">

        <!-- LOGIN -->
        <request>
            <dyn_variable name="authenticity_token" ></dyn_variable>
            <http url='/d/users/sign_in/' version='1.1' method='GET'></http>
         </request>

        <!-- wait for up to 2 seconds, user is typing names -->
        <thinktime value="2" random="true"></thinktime>

        <!-- create a random number to make a unique first name -->
        <setdynvars sourcetype="random_number" start="1" end="100">
            <var name="random_num" />
        </setdynvars>

        <!-- user log in -->
        <request subst="true">
            <http
            url='/d/users/sign_in/'
            version='1.1'
            method='POST'
            contents='authenticity_token=%%_authenticity_token%%&amp;user%5Bemail%5D=test%%_random_num%%%40test.com&amp;user%5Bpassword%5D=password&amp;commit=Log+in'>
            </http>
        </request>

        <!--LOGOUT-->
        <request>
            <http url="/d/users/sign_out/" version='1.1' method="DELETE"></http>
        </request>
        
    </session>
    
  </sessions>
</tsung>